app/Views/directory/viewrestaurant.php

SELECT *
FROM `restaraunts`
WHERE `RestarauntID` = '2'
---
        $db = \Config\Database::connect();
        $builder = $db->table('restaraunts');
        $builder->where('RestarauntID', $restarauntid);
        $query = $builder->get();